test/Lagrangian/tracer/system/Lagrangian/linear/LagrangianSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/Lagrangian/linear";
    object      LagrangianSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

tracking    linear;

ddtSchemes
{}

SpSchemes
{}

averagingSchemes
{}

interpolationSchemes
{
    default     cell;
    Uc          cellPoint;
}

accumulationSchemes
{}


// ************************************************************************* //
